app/controllers/school_classes_controller.rb

    def create
        @school_class = SchoolClass.new(school_params)
        if @school_class.valid?
            @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Autos"], ["room_number", 0], ["created_at", "2019-11-26 18:28:53.077424"], ["updated_at", "2019-11-26 18:28:53.077424"]]

    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["room_number", 200], ["updated_at", "2019-11-26 18:29:21.585633"], ["id", 1]]