app/controllers/students_controller.rb

def create
    @student = Student.new(student_params)
    if @student.valid?
        @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Devin "], ["last_name", "Kelly"], ["created_at", "2019-11-26 18:27:28.410989"], ["updated_at", "2019-11-26 18:27:28.410989"]]